# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\projects\LaserBodyRoll\Software\IOBoard.cydsn\IOBoard.cyprj
# Date: Mon, 23 Oct 2017 00:28:17 GMT
#set_units -time ns
create_clock -name {SPI_SCBCLK(FFB)} -period 62.5 -waveform {0 31.25} [list [get_pins {ClockBlock/ff_div_0}]]
create_clock -name {Clock_2(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_4}] [get_pins {ClockBlock/ff_div_5}]]
create_clock -name {Clock_1(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_6}] [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {ADC_1_intSarClock(FFB)} -period 83.333333333333329 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/ff_div_12}]]
create_clock -name {I2C_SCBCLK(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_1}]]
create_clock -name {VDAC_2_internalClock(FFB)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/ff_div_13}]]
create_clock -name {VDAC_1_internalClock(FFB)} -period 4000 -waveform {0 2000} [list [get_pins {ClockBlock/ff_div_14}]]
create_clock -name {CyILO} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFClk} -period 25000 -waveform {0 12500} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySysClk} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {SPI_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {Clock_2} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {ADC_1_intSarClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 5 9} [list]
create_generated_clock -name {I2C_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 7 13} [list]
create_generated_clock -name {VDAC_2_internalClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 193 385} [list]
create_generated_clock -name {VDAC_1_internalClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 193 385} [list]


# Component constraints for C:\projects\LaserBodyRoll\Software\IOBoard.cydsn\TopDesign\TopDesign.cysch
# Project: C:\projects\LaserBodyRoll\Software\IOBoard.cydsn\IOBoard.cyprj
# Date: Mon, 23 Oct 2017 00:28:15 GMT
